---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhasea
source: html/12ff857e-25bb-1fb5-2c07-6c743d7b7a30.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhasea Property

"Branch Circuit Current Phase A"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelBranchCircuitCurrentPhasea { get; }
```